__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 300, 300)     0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 300, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 100)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 298, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 293, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_15 (MaxPooling1D) (None, 149, 10)      0           conv1d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_16 (MaxPooling1D) (None, 146, 10)      0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
flatten_15 (Flatten)            (None, 1490)         0           max_pooling1d_15[0][0]           
__________________________________________________________________________________________________
flatten_16 (Flatten)            (None, 1460)         0           max_pooling1d_16[0][0]           
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 2950)         0           flatten_15[0][0]                 
                                                                 flatten_16[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_8[0][0]              
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 1)            51          dense_27[0][0]                   
==================================================================================================
Total params: 6,502,621
Trainable params: 6,502,621
Non-trainable params: 0
__________________________________________________________________________________________________
