__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 300, 10)      170         pos_input[0][0]                  
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 300, 300)     0                                            
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 300, 110)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 300, 110)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
bidirectional_10 (Bidirectional (None, 128)          90112       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 128)          0           bidirectional_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128)          512         dropout_10[0][0]                 
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            129         batch_normalization_10[0][0]     
==================================================================================================
Total params: 6,434,923
Trainable params: 6,434,667
Non-trainable params: 256
__________________________________________________________________________________________________
