__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 200)     0           WordEmbeddings[0][0]             
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 200)     0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 198, 10)      6010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 193, 10)      16010       dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_23 (MaxPooling1D) (None, 99, 10)       0           conv1d_23[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_24 (MaxPooling1D) (None, 96, 10)       0           conv1d_24[0][0]                  
__________________________________________________________________________________________________
flatten_23 (Flatten)            (None, 990)          0           max_pooling1d_23[0][0]           
__________________________________________________________________________________________________
flatten_24 (Flatten)            (None, 960)          0           max_pooling1d_24[0][0]           
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 1950)         0           flatten_23[0][0]                 
                                                                 flatten_24[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_12[0][0]             
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 1)            51          dense_23[0][0]                   
==================================================================================================
Total params: 6,463,621
Trainable params: 6,463,621
Non-trainable params: 0
__________________________________________________________________________________________________
