__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 200)     0           WordEmbeddings[0][0]             
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 200)          0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 128)          25728       global_average_pooling1d_1[0][0] 
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           8256        dense_5[0][0]                    
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,378,049
Trainable params: 34,049
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
