__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 300, 10)      170         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 298, 10)      3310        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 293, 10)      8810        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 149, 10)      0           conv1d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 146, 10)      0           conv1d_10[0][0]                  
__________________________________________________________________________________________________
flatten_9 (Flatten)             (None, 1490)         0           max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
flatten_10 (Flatten)            (None, 1460)         0           max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 2950)         0           flatten_9[0][0]                  
                                                                 flatten_10[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_5[0][0]              
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            51          dense_15[0][0]                   
==================================================================================================
Total params: 6,503,891
Trainable params: 6,503,891
Non-trainable params: 0
__________________________________________________________________________________________________
