__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 300, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_7[0][0]                   
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 298, 10)      3310        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 293, 10)      8810        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_21 (MaxPooling1D) (None, 149, 10)      0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_22 (MaxPooling1D) (None, 146, 10)      0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
flatten_21 (Flatten)            (None, 1490)         0           max_pooling1d_21[0][0]           
__________________________________________________________________________________________________
flatten_22 (Flatten)            (None, 1460)         0           max_pooling1d_22[0][0]           
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 2950)         0           flatten_21[0][0]                 
                                                                 flatten_22[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_11[0][0]             
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 1)            51          dense_33[0][0]                   
==================================================================================================
Total params: 6,503,721
Trainable params: 6,503,721
Non-trainable params: 0
__________________________________________________________________________________________________
