__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 200)     0           WordEmbeddings[0][0]             
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 200)     0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 198, 10)      6010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 193, 10)      16010       dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 99, 10)       0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 96, 10)       0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 990)          0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 960)          0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1950)         0           flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            51          dense_5[0][0]                    
==================================================================================================
Total params: 6,463,621
Trainable params: 119,621
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
