__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 300, 300)     0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 300, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 100)          0           parse_layer[0][0]                
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 128)          12928       global_average_pooling1d_1[0][0] 
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 64)           8256        dense_19[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_20[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,365,249
Trainable params: 21,249
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
