__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 200, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_2[0][0]                   
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 117)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 117)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 198, 10)      3520        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 193, 10)      9370        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_15 (MaxPooling1D) (None, 99, 10)       0           conv1d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_16 (MaxPooling1D) (None, 96, 10)       0           conv1d_16[0][0]                  
__________________________________________________________________________________________________
flatten_15 (Flatten)            (None, 990)          0           max_pooling1d_15[0][0]           
__________________________________________________________________________________________________
flatten_16 (Flatten)            (None, 960)          0           max_pooling1d_16[0][0]           
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 1950)         0           flatten_15[0][0]                 
                                                                 flatten_16[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_8[0][0]              
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            51          dense_15[0][0]                   
==================================================================================================
Total params: 6,454,491
Trainable params: 110,491
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
