__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 400, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_8[0][0]                   
__________________________________________________________________________________________________
global_average_pooling1d_12 (Gl (None, 117)          0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dense_46 (Dense)                (None, 128)          15104       global_average_pooling1d_12[0][0]
__________________________________________________________________________________________________
dense_47 (Dense)                (None, 64)           8256        dense_46[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_47[0][0]                   
__________________________________________________________________________________________________
dense_48 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,367,425
Trainable params: 6,367,425
Non-trainable params: 0
__________________________________________________________________________________________________
