__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 300, 10)      170         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
global_average_pooling1d_9 (Glo (None, 110)          0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dense_61 (Dense)                (None, 128)          14208       global_average_pooling1d_9[0][0] 
__________________________________________________________________________________________________
dense_62 (Dense)                (None, 64)           8256        dense_61[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_62[0][0]                   
__________________________________________________________________________________________________
dense_63 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,366,699
Trainable params: 6,366,699
Non-trainable params: 0
__________________________________________________________________________________________________
