__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 200, 17)      289         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 117)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 234)     0           wv_pos_concatenate[0][0]         
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 200, 234)     0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 128)          153600      spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 128)          0           bidirectional_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128)          512         dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            129         batch_normalization_4[0][0]      
==================================================================================================
Total params: 6,498,530
Trainable params: 6,498,274
Non-trainable params: 256
__________________________________________________________________________________________________
