__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 300, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 298, 10)      3310        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 293, 10)      8810        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 149, 10)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 146, 10)      0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 1490)         0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 1460)         0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 2950)         0           flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            51          dense_11[0][0]                   
==================================================================================================
Total params: 6,503,721
Trainable params: 159,721
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
