__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 400, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling1d_3 (Glo (None, 110)          0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 128)          14208       global_average_pooling1d_3[0][0] 
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 64)           8256        dense_25[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_26[0][0]                   
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,366,529
Trainable params: 22,529
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
