__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 400, 100)     0           WordEmbeddings[0][0]             
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 398, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 393, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 199, 10)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 196, 10)      0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1990)         0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1960)         0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 3950)         0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 3950)         0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 50)           197550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1)            51          dense_7[0][0]                    
==================================================================================================
Total params: 6,552,621
Trainable params: 208,621
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
