__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 400, 17)      289         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 117)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 400, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_11 (Bidirectional (None, 128)          93696       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 128)          0           bidirectional_11[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128)          512         dropout_11[0][0]                 
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            129         batch_normalization_11[0][0]     
==================================================================================================
Total params: 6,438,626
Trainable params: 6,438,370
Non-trainable params: 256
__________________________________________________________________________________________________
