__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 300, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_11[0][0]                  
__________________________________________________________________________________________________
global_average_pooling1d_11 (Gl (None, 110)          0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dense_67 (Dense)                (None, 128)          14208       global_average_pooling1d_11[0][0]
__________________________________________________________________________________________________
dense_68 (Dense)                (None, 64)           8256        dense_67[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_68[0][0]                   
__________________________________________________________________________________________________
dense_69 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,366,529
Trainable params: 6,366,529
Non-trainable params: 0
__________________________________________________________________________________________________
