__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 200)     0           WordEmbeddings[0][0]             
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 200, 200)     0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 128)          136192      spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128)          512         dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            129         batch_normalization_1[0][0]      
==================================================================================================
Total params: 6,480,833
Trainable params: 136,577
Non-trainable params: 6,344,256
__________________________________________________________________________________________________
