__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 400, 400)     0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 400, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 400, 100)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
conv1d_39 (Conv1D)              (None, 398, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_40 (Conv1D)              (None, 393, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_39 (MaxPooling1D) (None, 199, 10)      0           conv1d_39[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_40 (MaxPooling1D) (None, 196, 10)      0           conv1d_40[0][0]                  
__________________________________________________________________________________________________
flatten_39 (Flatten)            (None, 1990)         0           max_pooling1d_39[0][0]           
__________________________________________________________________________________________________
flatten_40 (Flatten)            (None, 1960)         0           max_pooling1d_40[0][0]           
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 3950)         0           flatten_39[0][0]                 
                                                                 flatten_40[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 3950)         0           concatenate_20[0][0]             
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 50)           197550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_40 (Dense)                (None, 1)            51          dense_39[0][0]                   
==================================================================================================
Total params: 6,552,621
Trainable params: 208,621
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
