__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 300, 10)      170         pos_input[0][0]                  
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 300, 300)     0                                            
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 300, 110)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 110)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 298, 10)      3310        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 293, 10)      8810        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_19 (MaxPooling1D) (None, 149, 10)      0           conv1d_19[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_20 (MaxPooling1D) (None, 146, 10)      0           conv1d_20[0][0]                  
__________________________________________________________________________________________________
flatten_19 (Flatten)            (None, 1490)         0           max_pooling1d_19[0][0]           
__________________________________________________________________________________________________
flatten_20 (Flatten)            (None, 1460)         0           max_pooling1d_20[0][0]           
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 2950)         0           flatten_19[0][0]                 
                                                                 flatten_20[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_10[0][0]             
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 1)            51          dense_31[0][0]                   
==================================================================================================
Total params: 6,503,891
Trainable params: 6,503,891
Non-trainable params: 0
__________________________________________________________________________________________________
