__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 300, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 300, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) (None, 128)          90112       spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 128)          0           bidirectional_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128)          512         dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1)            129         batch_normalization_5[0][0]      
==================================================================================================
Total params: 6,434,753
Trainable params: 90,497
Non-trainable params: 6,344,256
__________________________________________________________________________________________________
