__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 200, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling1d_3 (Glo (None, 117)          0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 128)          15104       global_average_pooling1d_3[0][0] 
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 64)           8256        dense_19[0][0]                   
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_20[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,367,425
Trainable params: 23,425
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
