__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 200, 17)      289         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 117)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 234)     0           wv_pos_concatenate[0][0]         
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
global_average_pooling1d_2 (Glo (None, 234)          0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 128)          30080       global_average_pooling1d_2[0][0] 
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           8256        dense_8[0][0]                    
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 64)           0           dense_9[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 1)            65          dropout_pred_0.50[0][0]          
==================================================================================================
Total params: 6,382,690
Trainable params: 38,690
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
