__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 200, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_4[0][0]                   
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 198, 10)      3520        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, 193, 10)      9370        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_31 (MaxPooling1D) (None, 99, 10)       0           conv1d_31[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_32 (MaxPooling1D) (None, 96, 10)       0           conv1d_32[0][0]                  
__________________________________________________________________________________________________
flatten_31 (Flatten)            (None, 990)          0           max_pooling1d_31[0][0]           
__________________________________________________________________________________________________
flatten_32 (Flatten)            (None, 960)          0           max_pooling1d_32[0][0]           
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 1950)         0           flatten_31[0][0]                 
                                                                 flatten_32[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_16[0][0]             
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 1)            51          dense_31[0][0]                   
==================================================================================================
Total params: 6,454,491
Trainable params: 6,454,491
Non-trainable params: 0
__________________________________________________________________________________________________
