_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
word_index_input (InputLayer (None, 400)               0         
_________________________________________________________________
WordEmbeddings (Embedding)   (None, 400, 100)          6344000   
_________________________________________________________________
spatial_dropout1d_7 (Spatial (None, 400, 100)          0         
_________________________________________________________________
bidirectional_7 (Bidirection (None, 128)               84992     
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 128)               512       
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 129       
=================================================================
Total params: 6,429,633
Trainable params: 85,377
Non-trainable params: 6,344,256
_________________________________________________________________
