__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 300, 10)      170         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 300, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_9 (Bidirectional) (None, 128)          90112       spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 128)          0           bidirectional_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128)          512         dropout_9[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            129         batch_normalization_9[0][0]      
==================================================================================================
Total params: 6,434,923
Trainable params: 6,434,667
Non-trainable params: 256
__________________________________________________________________________________________________
