__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 100)     0           filter_input[0][0]               
                                                                 WordEmbeddings[0][0]             
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 100)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 198, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 193, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_21 (MaxPooling1D) (None, 99, 10)       0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_22 (MaxPooling1D) (None, 96, 10)       0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
flatten_21 (Flatten)            (None, 990)          0           max_pooling1d_21[0][0]           
__________________________________________________________________________________________________
flatten_22 (Flatten)            (None, 960)          0           max_pooling1d_22[0][0]           
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 1950)         0           flatten_21[0][0]                 
                                                                 flatten_22[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_11[0][0]             
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1)            51          dense_21[0][0]                   
==================================================================================================
Total params: 6,452,621
Trainable params: 6,452,621
Non-trainable params: 0
__________________________________________________________________________________________________
