__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 300, 100)     0           WordEmbeddings[0][0]             
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 298, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 293, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 149, 10)      0           conv1d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 146, 10)      0           conv1d_8[0][0]                   
__________________________________________________________________________________________________
flatten_7 (Flatten)             (None, 1490)         0           max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
flatten_8 (Flatten)             (None, 1460)         0           max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 2950)         0           flatten_7[0][0]                  
                                                                 flatten_8[0][0]                  
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 2950)         0           concatenate_4[0][0]              
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 50)           147550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            51          dense_13[0][0]                   
==================================================================================================
Total params: 6,502,621
Trainable params: 6,502,621
Non-trainable params: 0
__________________________________________________________________________________________________
