__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 400, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 400, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_9 (Bidirectional) (None, 128)          93696       spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 128)          0           bidirectional_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128)          512         dropout_9[0][0]                  
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1)            129         batch_normalization_9[0][0]      
==================================================================================================
Total params: 6,438,337
Trainable params: 94,081
Non-trainable params: 6,344,256
__________________________________________________________________________________________________
