__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 200, 17)      289         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 200, 200)     0                                            
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 200, 117)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
parse_wv_concatenate (Concatena (None, 200, 234)     0           wv_pos_concatenate[0][0]         
                                                                 parse_layer[0][0]                
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 234)     0           parse_wv_concatenate[0][0]       
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 198, 10)      7030        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 193, 10)      18730       dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_29 (MaxPooling1D) (None, 99, 10)       0           conv1d_29[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_30 (MaxPooling1D) (None, 96, 10)       0           conv1d_30[0][0]                  
__________________________________________________________________________________________________
flatten_29 (Flatten)            (None, 990)          0           max_pooling1d_29[0][0]           
__________________________________________________________________________________________________
flatten_30 (Flatten)            (None, 960)          0           max_pooling1d_30[0][0]           
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 1950)         0           flatten_29[0][0]                 
                                                                 flatten_30[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_15[0][0]             
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 1)            51          dense_29[0][0]                   
==================================================================================================
Total params: 6,467,650
Trainable params: 6,467,650
Non-trainable params: 0
__________________________________________________________________________________________________
