__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 200, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 200, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_2[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 200, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) (None, 128)          93696       spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 128)          0           bidirectional_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128)          512         dropout_6[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            129         batch_normalization_6[0][0]      
==================================================================================================
Total params: 6,438,337
Trainable params: 6,438,081
Non-trainable params: 256
__________________________________________________________________________________________________
