__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 200)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 200, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 200, 100)     0           WordEmbeddings[0][0]             
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 198, 10)      3010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 193, 10)      8010        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 99, 10)       0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 96, 10)       0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 990)          0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 960)          0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1950)         0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 1950)         0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           97550       dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            51          dense_1[0][0]                    
==================================================================================================
Total params: 6,452,621
Trainable params: 108,621
Non-trainable params: 6,344,000
__________________________________________________________________________________________________
