__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 300)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 300)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 300, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 300, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
filter_input (InputLayer)       (None, 300, 300)     0                                            
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 300, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_4[0][0]                   
__________________________________________________________________________________________________
parse_layer (Lambda)            (None, 300, 110)     0           filter_input[0][0]               
                                                                 wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 300, 110)     0           parse_layer[0][0]                
__________________________________________________________________________________________________
bidirectional_12 (Bidirectional (None, 128)          90112       spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 128)          0           bidirectional_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128)          512         dropout_12[0][0]                 
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            129         batch_normalization_12[0][0]     
==================================================================================================
Total params: 6,434,753
Trainable params: 6,434,497
Non-trainable params: 256
__________________________________________________________________________________________________
