_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
word_index_input (InputLayer (None, 400)               0         
_________________________________________________________________
WordEmbeddings (Embedding)   (None, 400, 100)          6344000   
_________________________________________________________________
global_average_pooling1d_10  (None, 100)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 128)               12928     
_________________________________________________________________
dense_41 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_pred_0.50 (Dropout)  (None, 64)                0         
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 65        
=================================================================
Total params: 6,365,249
Trainable params: 6,365,249
Non-trainable params: 0
_________________________________________________________________
