__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 400, 10)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 110)     0           WordEmbeddings[0][0]             
                                                                 lambda_4[0][0]                   
__________________________________________________________________________________________________
dropout_input_0.50 (Dropout)    (None, 400, 110)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 398, 10)      3310        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 393, 10)      8810        dropout_input_0.50[0][0]         
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, 199, 10)      0           conv1d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, 196, 10)      0           conv1d_12[0][0]                  
__________________________________________________________________________________________________
flatten_11 (Flatten)            (None, 1990)         0           max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
flatten_12 (Flatten)            (None, 1960)         0           max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 3950)         0           flatten_11[0][0]                 
                                                                 flatten_12[0][0]                 
__________________________________________________________________________________________________
dropout_pred_0.50 (Dropout)     (None, 3950)         0           concatenate_6[0][0]              
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 50)           197550      dropout_pred_0.50[0][0]          
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1)            51          dense_17[0][0]                   
==================================================================================================
Total params: 6,553,721
Trainable params: 6,553,721
Non-trainable params: 0
__________________________________________________________________________________________________
