__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
POSEmbeddings (Embedding)       (None, 400, 17)      289         pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 117)     0           WordEmbeddings[0][0]             
                                                                 POSEmbeddings[0][0]              
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 400, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_8 (Bidirectional) (None, 128)          93696       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 128)          0           bidirectional_8[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128)          512         dropout_8[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1)            129         batch_normalization_8[0][0]      
==================================================================================================
Total params: 6,438,626
Trainable params: 94,370
Non-trainable params: 6,344,256
__________________________________________________________________________________________________
