_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
word_index_input (InputLayer (None, 300)               0         
_________________________________________________________________
WordEmbeddings (Embedding)   (None, 300, 100)          6344000   
_________________________________________________________________
global_average_pooling1d_7 ( (None, 100)               0         
_________________________________________________________________
dense_55 (Dense)             (None, 128)               12928     
_________________________________________________________________
dense_56 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_pred_0.50 (Dropout)  (None, 64)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 1)                 65        
=================================================================
Total params: 6,365,249
Trainable params: 6,365,249
Non-trainable params: 0
_________________________________________________________________
