__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
word_index_input (InputLayer)   (None, 400)          0                                            
__________________________________________________________________________________________________
pos_input (InputLayer)          (None, 400)          0                                            
__________________________________________________________________________________________________
WordEmbeddings (Embedding)      (None, 400, 100)     6344000     word_index_input[0][0]           
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 400, 17)      0           pos_input[0][0]                  
__________________________________________________________________________________________________
wv_pos_concatenate (Concatenate (None, 400, 117)     0           WordEmbeddings[0][0]             
                                                                 lambda_4[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 400, 117)     0           wv_pos_concatenate[0][0]         
__________________________________________________________________________________________________
bidirectional_12 (Bidirectional (None, 128)          93696       spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 128)          0           bidirectional_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128)          512         dropout_12[0][0]                 
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            129         batch_normalization_12[0][0]     
==================================================================================================
Total params: 6,438,337
Trainable params: 6,438,081
Non-trainable params: 256
__________________________________________________________________________________________________
