_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
word_index_input (InputLayer (None, 400)               0         
_________________________________________________________________
WordEmbeddings (Embedding)   (None, 400, 100)          6344000   
_________________________________________________________________
spatial_dropout1d_10 (Spatia (None, 400, 100)          0         
_________________________________________________________________
bidirectional_10 (Bidirectio (None, 128)               84992     
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 128)               512       
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 129       
=================================================================
Total params: 6,429,633
Trainable params: 6,429,377
Non-trainable params: 256
_________________________________________________________________
